android-studio
buku
doom1-wad
ffcast
freedoom
gzdoom
lf-bin
nix
otf-stix
pipes.sh
polybar
python2-scour
screenkey
tabbed
tdrop-git
ttf-computer-modern-fonts
ttf-iosevka
wpgtk-git
xorg-server-xdmx
xurls
yay
